import random
import time

a = False
while not a:
    print('Выберите скорость анимации. Введите s(медленно),m(средне),f(быстро)')
    speed = input()
    if speed == 's':
        speed = 1
        a = True
    elif speed == 'm':
        speed = 0.65
        a = True
    elif speed == 'f':
        speed = 0.4
        a = True

a = [
    ['0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '░', '░', '░', '░', '░', '░', '░', '░', '░', '░', '0'],
    ['0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0']
]
b = a

randoma = random.randint(0, 100)
for i in range(1, 11, 1):
    for j in range(1, 11, 1):
        if randoma < 30:
            a[i][j] = '█'
        randoma = random.randint(0, 100)

white = 0
black = 0
end = 0

while True:
    if end == 3:
        break
    b = a
    time.sleep(speed)
    print('\n' * 20)
    for i in range(1, 11, 1):  # строка
        for j in range(1, 11, 1):  # столбец
            print(a[i][j], end=' ')  # вывод списка по символу с отменой переноса
        print()  # перенос со строки на строку

    for i in range(1, 11, 1):  # строка
        for j in range(1, 11, 1):  # столбец

            for k in range(-1, 2, 1):  # Проверка соседних клеток
                for n in range(-1, 2, 1):
                    if a[i + k][j + n] == '█':
                        white += 1
                    elif a[i + k][j + n] == '░':
                        black += 1
            if a[i][j] == '█':  # Вычисление самой клетки
                white -= 1
            else:
                black -= 1
            if a[i][j] == '█':  # Операции с клеткой
                if white == 2 or white == 3:
                    a[i][j] = '█'
                else:
                    a[i][j] = '░'
            else:
                if white == 3:
                    a[i][j] = '█'
                else:
                    a[i][j] = '░'
            white = 0
            black = 0
# '█' '░'
